# Questão 5 da atividade introdução a Python
# Autor: Guilherme Guimarães dos Santos
# Data: 18/06/2022

print('-=' * 15)
print(f'{"Número":<10}{"Quadrado":<12}{"Cubo":>4}')
print(f'{0:<10}{0**2:<12}{0**3:<6}')
print(f'{1:<10}{1**2:<12}{1**3:<6}')
print(f'{2:<10}{2**2:<12}{2**3:<6}')
print(f'{3:<10}{3**2:<12}{3**3:<6}')
print(f'{4:<10}{4**2:<12}{4**3:<6}')
print(f'{5:<10}{5**2:<12}{5**3:<6}')
print(f'{6:<10}{6**2:<12}{6**3:<6}')
print(f'{7:<10}{7**2:<12}{7**3:<6}')
print(f'{8:<10}{8**2:<12}{8**3:<6}')
print(f'{9:<10}{9**2:<12}{9**3:<6}')
print(f'{10:<10}{10**2:<12}{10**3:<6}')
print('-=' * 15)
